# Handle Categorical Features

## 1. Ordinal Number Encoding

It is a grading system in which we can rank a categories

In [5]:
import datetime

In [6]:
today_date = datetime.datetime.today()
today_date

datetime.datetime(2021, 3, 8, 12, 42, 21, 134976)

In [10]:
today_date-datetime.timedelta(4)

datetime.datetime(2021, 3, 4, 12, 42, 21, 134976)

In [47]:
### List Comprehension
days = [today_date - datetime.timedelta(x) for x in range(0,15)]

In [48]:
import pandas as pd

In [49]:
data = pd.DataFrame(days)
data.columns = ["Day"]

In [50]:
data.head()

                         Day
0 2021-03-08 12:42:21.134976
1 2021-03-07 12:42:21.134976
2 2021-03-06 12:42:21.134976
3 2021-03-05 12:42:21.134976
4 2021-03-04 12:42:21.134976

In [43]:
data.drop("Day",axis=1,inplace=True)

In [44]:
len(data)

15

In [51]:
data["Day_Name"] = ["Sunday","Monday","Tuesday","Wednesday","Thursday","Friday","Saturday","Sunday","Monday","Tuesday","Wednesday","Thursday","Friday","Saturday","Sunday"]

In [52]:
data.head()

                         Day   Day_Name
0 2021-03-08 12:42:21.134976     Sunday
1 2021-03-07 12:42:21.134976     Monday
2 2021-03-06 12:42:21.134976    Tuesday
3 2021-03-05 12:42:21.134976  Wednesday
4 2021-03-04 12:42:21.134976   Thursday

In [53]:
dictionary = {"Monday":1,
             "Tuesday":2,
             "Wednesday":3,
             "Thursday":4,
             "Friday":5,
             "Saturday":6,
             "Sunday":7}

In [54]:
dictionary

{'Monday': 1,
 'Tuesday': 2,
 'Wednesday': 3,
 'Thursday': 4,
 'Friday': 5,
 'Saturday': 6,
 'Sunday': 7}

In [56]:
data["weekday_ordinal"] = data["Day_Name"].map(dictionary)

In [57]:
data

                          Day   Day_Name  weekday_ordinal
0  2021-03-08 12:42:21.134976     Sunday                7
1  2021-03-07 12:42:21.134976     Monday                1
2  2021-03-06 12:42:21.134976    Tuesday                2
3  2021-03-05 12:42:21.134976  Wednesday                3
4  2021-03-04 12:42:21.134976   Thursday                4
5  2021-03-03 12:42:21.134976     Friday                5
6  2021-03-02 12:42:21.134976   Saturday                6
7  2021-03-01 12:42:21.134976     Sunday                7
8  2021-02-28 12:42:21.134976     Monday                1
9  2021-02-27 12:42:21.134976    Tuesday                2
10 2021-02-26 12:42:21.134976  Wednesday                3
11 2021-02-25 12:42:21.134976   Thursday                4
12 2021-02-24 12:42:21.134976     Friday                5
13 2021-02-23 12:42:21.134976   Saturday                6
14 2021-02-22 12:42:21.134976     Sunday                7

# Count Or Frequency Encoding

In [74]:
train_set = pd.read_csv("http://archive.ics.uci.edu/ml/machine-learning-databases/adult/adult.data", header=None)

In [75]:
train_set.head()

,0,1,2,3,4,5,6,7,8,9,10,11,12,13,14
0,39,State-gov,77516,Bachelors,13,Never-married,Adm-clerical,Not-in-family,White,Male,2174,0,40,United-States,<=50K
1,50,Self-emp-not-inc,83311,Bachelors,13,Married-civ-spouse,Exec-managerial,Husband,White,Male,0,0,13,United-States,<=50K
2,38,Private,215646,HS-grad,9,Divorced,Handlers-cleaners,Not-in-family,White,Male,0,0,40,United-States,<=50K
3,53,Private,234721,11th,7,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,0,0,40,United-States,<=50K
4,28,Private,338409,Bachelors,13,Married-civ-spouse,Prof-specialty,Wife,Black,Female,0,0,40,Cuba,<=50K

In [76]:
train_set[1].unique()

array([' State-gov', ' Self-emp-not-inc', ' Private', ' Federal-gov',
       ' Local-gov', ' ?', ' Self-emp-inc', ' Without-pay',
       ' Never-worked'], dtype=object)

In [77]:
train_set[1].value_counts()

 Private             22696
 Self-emp-not-inc     2541
 Local-gov            2093
 ?                    1836
 State-gov            1298
 Self-emp-inc         1116
 Federal-gov           960
 Without-pay            14
 Never-worked            7
Name: 1, dtype: int64

In [78]:
len(train_set[1].unique())

9

In [79]:
columns = [1,3,5,6,7,8,9,13]

In [80]:
train_set[columns]

,1,3,5,6,7,8,9,13
0,State-gov,Bachelors,Never-married,Adm-clerical,Not-in-family,White,Male,United-States
1,Self-emp-not-inc,Bachelors,Married-civ-spouse,Exec-managerial,Husband,White,Male,United-States
2,Private,HS-grad,Divorced,Handlers-cleaners,Not-in-family,White,Male,United-States
3,Private,11th,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,United-States
4,Private,Bachelors,Married-civ-spouse,Prof-specialty,Wife,Black,Female,Cuba
...,...,...,...,...,...,...,...,...
32556,Private,Assoc-acdm,Married-civ-spouse,Tech-support,Wife,White,Female,United-States
32557,Private,HS-grad,Married-civ-spouse,Machine-op-inspct,Husband,White,Male,United-States
32558,Private,HS-grad,Widowed,Adm-clerical,Unmarried,White,Female,United-States
32559,Private,HS-grad,Never-married,Adm-clerical,Own-child,White,Male,United-States
32560,Self-emp-inc,HS-grad,Married-civ-spouse,Exec-managerial,Wife,White,Female,United-States

In [81]:
training_set = train_set[columns]
training_set.columns = ["Employment","Degree","Status","Designation","family_job","Race","Sex","Country"]

In [82]:
training_set.head()

,Employment,Degree,Status,Designation,family_job,Race,Sex,Country
0,State-gov,Bachelors,Never-married,Adm-clerical,Not-in-family,White,Male,United-States
1,Self-emp-not-inc,Bachelors,Married-civ-spouse,Exec-managerial,Husband,White,Male,United-States
2,Private,HS-grad,Divorced,Handlers-cleaners,Not-in-family,White,Male,United-States
3,Private,11th,Married-civ-spouse,Handlers-cleaners,Husband,Black,Male,United-States
4,Private,Bachelors,Married-civ-spouse,Prof-specialty,Wife,Black,Female,Cuba

In [87]:
for feature in training_set.columns[:]:

    print(feature, ":", len(training_set[feature].unique()),"Labels")

Employment : 9 Labels
Degree : 16 Labels
Status : 7 Labels
Designation : 15 Labels
family_job : 6 Labels
Race : 5 Labels
Sex : 2 Labels
Country : 42 Labels

In [101]:
country_map = training_set["Country"].value_counts().to_dict()

In [103]:
training_set["Country"] = training_set["Country"].map(country_map)

<ipython-input-103-03d133a0b699>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  training_set["Country"] = training_set["Country"].map(country_map)

In [105]:
training_set["Country"]

0        29170
1        29170
2        29170
3        29170
4           95
         ...
32556    29170
32557    29170
32558    29170
32559    29170
32560    29170
Name: Country, Length: 32561, dtype: int64

#### Advantages 
1. Easy To Use.
2. Not increasing featur space

#### Disadvantages
1. It will not able to handle where the frequency are same because it will provide a same weight

# Target Guided Ordinal Encoding
1. Ordering the labels according to the target
2. Replace the labels by the joint probability of being 1 or 0

In [110]:
import pandas as pd

titanic = pd.read_csv("train.csv",usecols=["Cabin","Survived"])
titanic.head()

   Survived Cabin
0         0   NaN
1         1   C85
2         1   NaN
3         1  C123
4         0   NaN

In [112]:
titanic["Cabin"].fillna("Missing",inplace=True)

In [113]:
df.head()

      Sex
0    male
1  female
2  female
3  female
4    male

In [114]:
titanic["Cabin"].value_counts()

Missing        687
C23 C25 C27      4
B96 B98          4
G6               4
D                3
              ...
D49              1
B19              1
D21              1
D37              1
D46              1
Name: Cabin, Length: 148, dtype: int64

In [124]:
titanic["Cabin_new"] = titanic["Cabin"].astype(str).str[0]

In [125]:
titanic.head()

   Survived    Cabin Cabin_new
0         0  Missing         M
1         1      C85         C
2         1  Missing         M
3         1     C123         C
4         0  Missing         M

In [126]:
titanic["Cabin_new"].value_counts()

M    687
C     59
B     47
D     33
E     32
A     15
F     13
G      4
T      1
Name: Cabin_new, dtype: int64

In [129]:
titanic.groupby(["Cabin_new"])["Survived"].mean()

Cabin_new
A    0.466667
B    0.744681
C    0.593220
D    0.757576
E    0.750000
F    0.615385
G    0.500000
M    0.299854
T    0.000000
Name: Survived, dtype: float64

In [134]:
titanic.groupby(["Cabin_new"])["Survived"].mean().sort_values().index

Index(['T', 'M', 'A', 'G', 'C', 'F', 'B', 'E', 'D'], dtype='object', name='Cabin_new')

In [135]:
ordinal_labels = titanic.groupby("Cabin_new")["Survived"].mean().sort_values().index
ordinal_labels

Index(['T', 'M', 'A', 'G', 'C', 'F', 'B', 'E', 'D'], dtype='object', name='Cabin_new')

In [136]:
ordinal_label2 = {k:i for i,k in enumerate(ordinal_labels,0)}
ordinal_label2

{'T': 0, 'M': 1, 'A': 2, 'G': 3, 'C': 4, 'F': 5, 'B': 6, 'E': 7, 'D': 8}

In [137]:
titanic["Cabin_ordinal_labels"] = titanic["Cabin_new"].map(ordinal_label2)
titanic.head()

   Survived    Cabin Cabin_new  Cabin_ordinal_labels
0         0  Missing         M                     1
1         1      C85         C                     4
2         1  Missing         M                     1
3         1     C123         C                     4
4         0  Missing         M                     1

# Mean Encoding

In [141]:
mean_encoding = titanic.groupby(["Cabin_new"])["Survived"].mean().to_dict()

In [142]:
titanic["Cabin_ordinal_mean"] = titanic["Cabin_new"].map(mean_encoding)

In [143]:
titanic.head()

   Survived    Cabin Cabin_new  Cabin_ordinal_labels  Cabin_ordinal_mean
0         0  Missing         M                     1            0.299854
1         1      C85         C                     4            0.593220
2         1  Missing         M                     1            0.299854
3         1     C123         C                     4            0.593220
4         0  Missing         M                     1            0.299854

# Probability Ratio Encoding

In [144]:
import pandas as pd

In [145]:
df = pd.read_csv("train.csv",usecols=["Cabin","Survived"])
df.head()

   Survived Cabin
0         0   NaN
1         1   C85
2         1   NaN
3         1  C123
4         0   NaN

In [146]:
# Replace
df["Cabin"].fillna("Missing",inplace=True)

In [149]:
df.head(10)

   Survived    Cabin
0         0  Missing
1         1      C85
2         1  Missing
3         1     C123
4         0  Missing
5         0  Missing
6         0      E46
7         0  Missing
8         1  Missing
9         1  Missing

In [150]:
df["Cabin"].unique()

array(['Missing', 'C85', 'C123', 'E46', 'G6', 'C103', 'D56', 'A6',
       'C23 C25 C27', 'B78', 'D33', 'B30', 'C52', 'B28', 'C83', 'F33',
       'F G73', 'E31', 'A5', 'D10 D12', 'D26', 'C110', 'B58 B60', 'E101',
       'F E69', 'D47', 'B86', 'F2', 'C2', 'E33', 'B19', 'A7', 'C49', 'F4',
       'A32', 'B4', 'B80', 'A31', 'D36', 'D15', 'C93', 'C78', 'D35',
       'C87', 'B77', 'E67', 'B94', 'C125', 'C99', 'C118', 'D7', 'A19',
       'B49', 'D', 'C22 C26', 'C106', 'C65', 'E36', 'C54',
       'B57 B59 B63 B66', 'C7', 'E34', 'C32', 'B18', 'C124', 'C91', 'E40',
       'T', 'C128', 'D37', 'B35', 'E50', 'C82', 'B96 B98', 'E10', 'E44',
       'A34', 'C104', 'C111', 'C92', 'E38', 'D21', 'E12', 'E63', 'A14',
       'B37', 'C30', 'D20', 'B79', 'E25', 'D46', 'B73', 'C95', 'B38',
       'B39', 'B22', 'C86', 'C70', 'A16', 'C101', 'C68', 'A10', 'E68',
       'B41', 'A20', 'D19', 'D50', 'D9', 'A23', 'B50', 'A26', 'D48',
       'E58', 'C126', 'B71', 'B51 B53 B55', 'D49', 'B5', 'B20', 'F G63',
       'C62 C64', 'E24', 'C90', 'C45', 'E8', 'B101', 'D45', 'C46', 'D30',
       'E121', 'D11', 'E77', 'F38', 'B3', 'D6', 'B82 B84', 'D17', 'A36',
       'B102', 'B69', 'E49', 'C47', 'D28', 'E17', 'A24', 'C50', 'B42',
       'C148'], dtype=object)

In [151]:
df["Cabin_new"] = df["Cabin"].astype(str).str[0]
df.head()

   Survived    Cabin Cabin_new
0         0  Missing         M
1         1      C85         C
2         1  Missing         M
3         1     C123         C
4         0  Missing         M

In [178]:
df["Cabin_new"].unique()

array(['M', 'C', 'E', 'G', 'D', 'A', 'B', 'F', 'T'], dtype=object)

In [179]:
prob_df = df.groupby(["Cabin_new"])["Survived"].mean()
prob_df = pd.DataFrame(prob_df)
prob_df

           Survived
Cabin_new
A          0.466667
B          0.744681
C          0.593220
D          0.757576
E          0.750000
F          0.615385
G          0.500000
M          0.299854
T          0.000000

In [180]:
prob_df["Died"] = 1-prob_df["Survived"]

In [181]:
prob_df

           Survived      Died
Cabin_new
A          0.466667  0.533333
B          0.744681  0.255319
C          0.593220  0.406780
D          0.757576  0.242424
E          0.750000  0.250000
F          0.615385  0.384615
G          0.500000  0.500000
M          0.299854  0.700146
T          0.000000  1.000000

In [184]:
prob_df["probability_ratio"] = prob_df["Survived"]/prob_df["Died"]
prob_df.head()

           Survived      Died  probability_ratio
Cabin_new
A          0.466667  0.533333           0.875000
B          0.744681  0.255319           2.916667
C          0.593220  0.406780           1.458333
D          0.757576  0.242424           3.125000
E          0.750000  0.250000           3.000000

In [186]:
probability_encoded = prob_df["probability_ratio"].to_dict()
probability_encoded

{'A': 0.875,
 'B': 2.916666666666666,
 'C': 1.4583333333333333,
 'D': 3.125,
 'E': 3.0,
 'F': 1.6000000000000003,
 'G': 1.0,
 'M': 0.42827442827442824,
 'T': 0.0}

In [189]:
df["Cabin_encoded"] = df["Cabin_new"].map(probability_encoded)

In [190]:
df.head()

   Survived    Cabin Cabin_new  Cabin_encoded
0         0  Missing         M       0.428274
1         1      C85         C       1.458333
2         1  Missing         M       0.428274
3         1     C123         C       1.458333
4         0  Missing         M       0.428274